Конфигурация/Catalogs/ДепозитарныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДепозитарныеСчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненныеРазделы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попекаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПопечения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЛицевойСчетВЕСИАФинанс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СовместноеВладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантДлиныСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДлиныСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ТипыДепозитарныхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДепозитарныхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозитарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазделДепозитарногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицевой</Name>
					<Comment>Такие счета используются для ведения реестров ЦБ у регистраторов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ДепозитарныеСчета/Forms/МастерСозданияНового/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	ТипДепСчетаОтветХранения = (Форма.ТипДепозитарногоСчета = ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение"));
	ТипДепСчетаЛицевой		 = (Форма.ТипДепозитарногоСчета = ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Лицевой"));
	ТипДепСчетаДепозитарный  = (Форма.ТипДепозитарногоСчета = ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Депозитарный"));
	
	Элементы.ГруппаСобственныйДепозитарныйСчет.Видимость = НЕ Форма.ДепозитарныйСчетКонтрагента;
	Элементы.ГруппаДепозитарныйСчетКонтрагента.Видимость = Форма.ДепозитарныйСчетКонтрагента;
	
	
	Если Форма.ДепозитарныйСчетКонтрагента Тогда
		Элементы.ЭмитентСчетаКонтрагента.Видимость = ТипДепСчетаЛицевой;
	
	Иначе
		
		Элементы.СчетДоверительногоУправления.Видимость = Форма.ЗарегистрироватьИсполнителя;
		
		Элементы.ДепозитарныйДоговор.Видимость                  = (Форма.ВыбратьДепозитарныйДоговор = 2);
		Элементы.ГруппаОбщиеРеквизиты.ТолькоПросмотр            = (Форма.ВыбратьДепозитарныйДоговор = 2);
		
		Элементы.ГруппаРеквизитыДепозитарногоДоговора.Видимость = (Форма.ВыбратьДепозитарныйДоговор = 1);
		Элементы.ВидДоговора.Видимость 							= (Форма.ВыбратьДепозитарныйДоговор = 1);
		
		Элементы.ДепозитарныйСчет.Видимость                  = (Форма.ВыбратьДепозитарныйСчет = 2);
		Элементы.ВидСчета.ТолькоПросмотр                     = (Форма.ВыбратьДепозитарныйСчет = 2);
		Элементы.ВидСчета.Видимость                          = (Форма.ВыбратьДепозитарныйСчет = 1 И НЕ ТипДепСчетаОтветХранения);
		Элементы.ТипДепозитарногоСчета.Видимость             = (Форма.ВыбратьДепозитарныйСчет = 1);
		
		Элементы.ГруппаРеквизитыДепозитарногоСчета.Видимость = (Форма.ВыбратьДепозитарныйСчет = 1 И НЕ ТипДепСчетаОтветХранения);
		Элементы.ГруппаКодыВоВнешнихСистемах.Видимость       = ТипДепСчетаДепозитарный Или (Форма.ВыбратьДепозитарныйСчет = 2) Или (Форма.ВыбратьРазделДепозитарногоСчета = 2);
		
		Если Не ТипДепСчетаДепозитарный И Форма.ВыбратьДепозитарныйСчет = 1 ИЛИ Форма.ВыбратьДепозитарныйСчет = 2 И Не ЗначениеЗаполнено(Форма.ДепозитарныйСчет) ИЛИ Форма.ВыбратьРазделДепозитарногоСчета = 1 Тогда
			Форма.КодДляСверкиСБрокером     = "";
			Форма.КодДляСверкиСДепозитарием = "";	
		КонецЕсли;
		
		Элементы.КодДляСверкиСБрокером.Доступность     = Истина;
		Элементы.КодДляСверкиСДепозитарием.Доступность = Истина;
		
		Элементы.ГруппаРазделДепозитарногоСчета.Видимость           = (Форма.ВидСчета = ПредопределенноеЗначение("Перечисление.ВидыДепозитарныхСчетов.Торговый") ИЛИ Форма.ВидСчета = ПредопределенноеЗначение("Перечисление.ВидыДепозитарныхСчетов.DVP")) И Не ТипДепСчетаЛицевой;
		Элементы.РазделДепозитарногоСчета.Видимость                 = (Форма.ВыбратьРазделДепозитарногоСчета = 2) И Не ТипДепСчетаЛицевой; 
		Элементы.ГруппаРеквизитыРазделаДепозитарногоСчета.Видимость = (Форма.ВыбратьРазделДепозитарногоСчета = 1) И Не ТипДепСчетаЛицевой;
		
		Элементы.Попечитель.Видимость       = Форма.Попекаемый И Не ТипДепСчетаЛицевой;
		Элементы.ДоговорПопечения.Видимость = Форма.Попекаемый И Не ТипДепСчетаЛицевой;
		
		Элементы.ВыбратьДепозитарныйСчет.ТолькоПросмотр         = (Форма.ВыбратьДепозитарныйДоговор = 1);
		Элементы.ВыбратьРазделДепозитарногоСчета.ТолькоПросмотр = (Форма.ВыбратьДепозитарныйСчет = 1);
		
		Элементы.ВидСчета.ТолькоПросмотр	= ТипДепСчетаЛицевой;
		Элементы.НомерРаздела.Видимость		= Не ТипДепСчетаЛицевой;
		Элементы.Брокер.Видимость			= Не ТипДепСчетаЛицевой;
		Элементы.Попекаемый.Видимость		= Не ТипДепСчетаЛицевой;
		Элементы.Эмитент.Видимость			= ТипДепСчетаЛицевой;
	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимостьДоступность

&НаСервере
Функция СоздатьДепозитарныйСчетНаСервере()

	НачатьТранзакцию();
	
	Если ЭтаФорма.ВыбратьДепозитарныйДоговор = 1 Тогда
		
		НовыйДепозитарныйДоговор = Справочники.Договоры.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(НовыйДепозитарныйДоговор, ЭтаФорма, "Организация, ВидДоговора, НомерДоговора, ДатаЗаключения");
		
		НовыйДепозитарныйДоговор.Контрагент		= ЭтаФорма.Депозитарий.ЮрФизЛицо;
		НовыйДепозитарныйДоговор.Наименование	= Справочники.Договоры.СформироватьНаименование(НовыйДепозитарныйДоговор);
		
		Если НЕ ЗаписатьОбъект(НовыйДепозитарныйДоговор) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭтаФорма.ДатаРасторжения) Тогда
			МенеджерЗаписи = РегистрыСведений.УсловияДоговоровОбщие.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период			= ?(ЗначениеЗаполнено(ЭтаФорма.ДатаЗаключения), ЭтаФорма.ДатаЗаключения, ЭтаФорма.ДатаРасторжения);
			МенеджерЗаписи.Договор			= НовыйДепозитарныйДоговор.Ссылка;
			МенеджерЗаписи.ДатаРасторжения	= ЭтаФорма.ДатаРасторжения;
			
			Если НЕ ЗаписатьОбъект(МенеджерЗаписи) Тогда
				Возврат Ложь;
			КонецЕсли;

		КонецЕсли;
		
		ЭтаФорма.ДепозитарныйДоговор = НовыйДепозитарныйДоговор.Ссылка;
	КонецЕсли;
	
	Если ЭтаФорма.ВыбратьДепозитарныйСчет = 1 ИЛИ ЭтаФорма.ДепозитарныйСчетКонтрагента Тогда
		НовыйДепозитарныйСчет = Справочники.ДепозитарныеСчета.СоздатьЭлемент();
		
		НовыйДепозитарныйСчет.ТипСчета = ЭтаФорма.ТипДепозитарногоСчета;
		Если НовыйДепозитарныйСчет.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.Лицевой Тогда
			ЗаполнитьЗначенияСвойств(НовыйДепозитарныйСчет, ЭтаФорма, "ВидСчета, НомерСчета, Попекаемый, Попечитель, ДоговорПопечения, ДатаЗакрытия, Эмитент");
			
		ИначеЕсли НовыйДепозитарныйСчет.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.Депозитарный Тогда
			Если ЭтаФорма.ДепозитарныйСчетКонтрагента Тогда
				ЭтаФорма.ВидСчета = Перечисления.ВидыДепозитарныхСчетов.Основной;
			КонецЕсли;
			
			НовыйДепозитарныйСчет.ПодчиненныеРазделы = (ЭтаФорма.ВидСчета = Перечисления.ВидыДепозитарныхСчетов.Торговый) или (ЭтаФорма.ВидСчета = Перечисления.ВидыДепозитарныхСчетов.DVP);
			
			ЗаполнитьЗначенияСвойств(НовыйДепозитарныйСчет, ЭтаФорма, "ВидСчета, НомерСчета, Попекаемый, Попечитель, ДоговорПопечения, ДатаЗакрытия");
		КонецЕсли;
		
		НовыйДепозитарныйСчет.Организация   = ЭтаФорма.Организация;
		НовыйДепозитарныйСчет.ВладелецСчета = ЭтаФорма.ВладелецСчета;
		НовыйДепозитарныйСчет.Депозитарий   = ЭтаФорма.Депозитарий;
		НовыйДепозитарныйСчет.Договор       = ЭтаФорма.ДепозитарныйДоговор;
		НовыйДепозитарныйСчет.Наименование  = Справочники.ДепозитарныеСчета.СформироватьНаименование(НовыйДепозитарныйСчет);
		
		Если НовыйДепозитарныйСчет.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.ОтветственноеХранение Тогда
			НовыйДепозитарныйСчет.ДатаОткрытия = ЭтаФорма.ДатаЗаключения;
		Иначе
			НовыйДепозитарныйСчет.ДатаОткрытия = ЭтаФорма.ДатаОткрытияСчета;
		КонецЕсли;
		
		НовыйДепозитарныйСчет.ДатаЗакрытия  = ЭтаФорма.ДатаРасторжения;
			
		Если НЕ ЗаписатьОбъект(НовыйДепозитарныйСчет) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ЭтаФорма.ДепозитарныйСчет = НовыйДепозитарныйСчет.Ссылка;
		
	КонецЕсли;

	Если ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 1 Тогда
		НовыйРазделДепозитарногоСчета = Справочники.ДепозитарныеСчета.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(НовыйРазделДепозитарногоСчета, ЭтаФорма, "Организация, Депозитарий, Брокер, Попекаемый, Попечитель, ДоговорПопечения, ДатаЗакрытия");
		
		НовыйРазделДепозитарногоСчета.Родитель     = ЭтаФорма.ДепозитарныйСчет;
		НовыйРазделДепозитарногоСчета.Договор      = ЭтаФорма.ДепозитарныйДоговор;
		НовыйРазделДепозитарногоСчета.ТипСчета     = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета;
		НовыйРазделДепозитарногоСчета.НомерСчета   = ЭтаФорма.НомерРаздела;
		НовыйРазделДепозитарногоСчета.Наименование = Справочники.ДепозитарныеСчета.СформироватьНаименование(НовыйРазделДепозитарногоСчета);
		НовыйРазделДепозитарногоСчета.ДатаОткрытия = ЭтаФорма.ДатаОткрытияРазделаСчета;
		НовыйРазделДепозитарногоСчета.ДатаЗакрытия = ЭтаФорма.ДепозитарныйСчет.ДатаЗакрытия;
		НовыйРазделДепозитарногоСчета.ВладелецСчета= ЭтаФорма.ВладелецСчета;
		
		Если НЕ ЗаписатьОбъект(НовыйРазделДепозитарногоСчета) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ЭтаФорма.РазделДепозитарногоСчета = НовыйРазделДепозитарногоСчета.Ссылка;
	КонецЕсли;
	
	Если ЭтаФорма.ЗарегистрироватьИсполнителя Тогда
		АктивныйДепозитарныйСчет = ?(ЭтаФорма.ВыбратьРазделДепозитарногоСчета > 0, ЭтаФорма.РазделДепозитарногоСчета, ЭтаФорма.ДепозитарныйСчет);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет
			|ИЗ
			|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
			|ГДЕ
			|	ИсполнителиПоЦеннымБумагам.Организация = &Организация
			|	И ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|	И ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет = &ДепозитарныйСчет";
			
		Запрос.УстановитьПараметр("Организация",                  ЭтаФорма.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ДепозитарныйСчет",             АктивныйДепозитарныйСчет);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Такой исполнитель уже существует",
				?(ЭтаФорма.ВыбратьРазделДепозитарногоСчета > 0, "РазделДепозитарногоСчета", "ДепозитарныйСчет"));
			Возврат Ложь;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ИсполнителиПоЦеннымБумагам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Организация                  = ЭтаФорма.Организация;
		МенеджерЗаписи.СчетДоверительногоУправления = ЭтаФорма.СчетДоверительногоУправления;
		МенеджерЗаписи.ДепозитарныйСчет             = АктивныйДепозитарныйСчет;
		МенеджерЗаписи.ДатаЗакрытия                 = АктивныйДепозитарныйСчет.ДатаЗакрытия;
		
		Если НЕ ЗаписатьОбъект(МенеджерЗаписи) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.КодДляСверкиСБрокером) Тогда
		
		РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(?(ЭтаФорма.ВыбратьРазделДепозитарногоСчета > 0, ЭтаФорма.РазделДепозитарногоСчета, ЭтаФорма.ДепозитарныйСчет),
			Справочники.ВнешниеСистемы.ОтчетБрокераБКРегион,
			Справочники.ГруппыИмпортируемыхОбъектов.ДепозитарныеСчета,
			ЭтаФорма.КодДляСверкиСБрокером,
			,,
			Дата(1980, 1, 1));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.КодДляСверкиСДепозитарием) Тогда
		
		РаботаСВнешнимиСистемами.ЗарегистрироватьКодОбъектаВоВнешнейСистеме(?(ЭтаФорма.ВыбратьРазделДепозитарногоСчета > 0, ЭтаФорма.РазделДепозитарногоСчета, ЭтаФорма.ДепозитарныйСчет),
			Справочники.ВнешниеСистемы.ОтчетДепозитарияДКРегион,
			Справочники.ГруппыИмпортируемыхОбъектов.ДепозитарныеСчета,
			ЭтаФорма.КодДляСверкиСДепозитарием,
			,,
			Дата(1980, 1, 1));
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции // СоздатьДепозитарныйСчетНаСервере

&НаСервереБезКонтекста
Функция ЗаписатьОбъект(Объект)

	Результат = Истина;
	
	Попытка 
		Объект.Записать();
	Исключение
		Результат = Ложь;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьФормуПоРанееСозданнымИсполнителямНаСервере(ИмяЭлемента)
	
	Если ИмяЭлемента = "СчетДоверительногоУправления" Тогда // выберем последний созданный договор
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор КАК ДепозитарныйДоговор,
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Депозитарий КАК Депозитарий,
			|	ВЫРАЗИТЬ(ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор КАК Справочник.Договоры).ВидДоговора КАК ВидДоговора,
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор.НомерДоговора КАК НомерДоговора,
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор.ДатаЗаключения КАК ДатаЗаключения,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаРасторжения
			|ИЗ
			|	РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&ТекущаяДата, ) КАК УсловияДоговоровОбщиеСрезПоследних
			|		ПО ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор = УсловияДоговоровОбщиеСрезПоследних.Договор
			|ГДЕ
			|	ИсполнителиПоЦеннымБумагам.Организация = &Организация
			|	И ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор.ДатаЗаключения УБЫВ";
			
		Запрос.УстановитьПараметр("Организация",                  ЭтаФорма.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("ТекущаяДата",                  ТекущаяДата());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ДепозитарныйДоговор) Тогда
		ЭтаФорма.ВыбратьДепозитарныйДоговор      = 1;
		ЭтаФорма.ВыбратьДепозитарныйСчет         = 1;
		ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 0;
		Возврат;
	КонецЕсли;
	
	// если договор д/у заполнен, то по ранее созданным исполнителям определим наиболее вероятный
	// режим создания исполнителя:
	//   1. если счетов нет - создаем основной счет
	//   2. если основной счет, но нет торговых - создаем торговый счет с разделами
	//   3. если раздел торгового счета - создаем еще раздел торгового счета, ибо чаще всего их минимум 2
	//   4. если есть ответ. хранение - создаем новый счет соотв. типа

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА 3
		|		КОГДА ДепозитарныеСчета.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Основной)
		|			ТОГДА 2
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ДепозитарныеСчета.Родитель
		|		ИНАЧЕ ДепозитарныеСчета.Ссылка
		|	КОНЕЦ КАК ДепозитарныйСчет,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДепозитарныхСчетов.Торговый)
		|		ИНАЧЕ ДепозитарныеСчета.ВидСчета
		|	КОНЕЦ КАК ВидСчета,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ДепозитарныеСчета.Родитель.НомерСчета
		|		ИНАЧЕ ДепозитарныеСчета.НомерСчета
		|	КОНЕЦ КАК НомерСчета,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ДепозитарныеСчета.Родитель.Попекаемый
		|		ИНАЧЕ ДепозитарныеСчета.Попекаемый
		|	КОНЕЦ КАК Попекаемый,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ДепозитарныеСчета.Родитель.Попечитель
		|		ИНАЧЕ ДепозитарныеСчета.Попечитель
		|	КОНЕЦ КАК Попечитель,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ДепозитарныеСчета.Родитель.ДоговорПопечения
		|		ИНАЧЕ ДепозитарныеСчета.ДоговорПопечения
		|	КОНЕЦ КАК ДоговорПопечения,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ДепозитарныеСчета.Родитель.ДатаЗакрытия
		|		ИНАЧЕ ДепозитарныеСчета.ДатаЗакрытия
		|	КОНЕЦ КАК ДатаЗакрытия,
		|	ВЫБОР
		|		КОГДА ДепозитарныеСчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета)
		|			ТОГДА ДепозитарныеСчета.Ссылка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДепозитарныеСчета.ПустаяСсылка)
		|	КОНЕЦ КАК РазделДепозитарногоСчета
		|ИЗ
		|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
		|ГДЕ
		|	ДепозитарныеСчета.Договор = &Договор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет УБЫВ";
		
	Запрос.УстановитьПараметр("Договор", ЭтаФорма.ДепозитарныйДоговор);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);
		
		ЭтаФорма.ВыбратьДепозитарныйДоговор = 2;
		
		Если      Выборка.Приоритет = 3 Тогда // создаем новый раздел
			ЭтаФорма.ВыбратьДепозитарныйСчет         = 2;
			ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 1;
			
		ИначеЕсли Выборка.Приоритет = 2 Тогда // создаем новый торговый счет с разделом
			ЭтаФорма.ВыбратьДепозитарныйСчет         = 1;
			ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 1;
			
			ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "НомерСчета, Попекаемый, Попечитель, ДоговорПопечения, ДатаЗакрытия");
			
			ЭтаФорма.ВидСчета     = Перечисления.ВидыДепозитарныхСчетов.Торговый;
			ЭтаФорма.ДатаЗакрытия = ЭтаФорма.ДатаРасторжения;
			
		ИначеЕсли Выборка.Приоритет = 1 Тогда // создаем новый счет ответ. хранения
			ЭтаФорма.ВыбратьДепозитарныйСчет         = 1;
			ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 0;
			
			ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "ВидСчета, НомерСчета, Попекаемый, Попечитель, ДоговорПопечения, ДатаЗакрытия");
			
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры // ЗаполнитьФормуПоРанееСозданнымИсполнителямНаСервере

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыФормыПриИзмененииДепозитарногоСчета(ЭтаФорма, ЗаполнитьРеквизитыДоговора = Ложь)
	
	РеквизитыДепозитарногоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтаФорма.ДепозитарныйСчет, "Договор, ВидСчета, НомерСчета, Попекаемый, Попечитель, ДоговорПопечения, ДатаЗакрытия");	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РеквизитыДепозитарногоСчета);	
		
	Если ЗаполнитьРеквизитыДоговора Тогда
		
		ЭтаФорма.ДепозитарныйДоговор = РеквизитыДепозитарногоСчета.Договор;	
		
		ЗаполнитьРеквизитыФормыПриИзмененииДепозитарногоДоговора(ЭтаФорма);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыФормыПриИзмененииДепозитарногоДоговора(ЭтаФорма)

	ЗаполнитьЗначенияСвойств(ЭтаФорма,
		РаботаСНормативноСправочнойИнформацией.ПолучитьРеквизитыДоговора(ЭтаФорма.ДепозитарныйДоговор, "Депозитарий, ВидДоговора, НомерДоговора, ДатаЗаключения, ДатаРасторжения"));
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	// установим заголовок формы
	Если ЭтаФорма.Параметры.Свойство("ИсполнителиПоЦеннымБумагам") И ЭтаФорма.Параметры.ИсполнителиПоЦеннымБумагам = Истина Тогда
		ЭтаФорма.Заголовок = Метаданные.РегистрыСведений.ИсполнителиПоЦеннымБумагам.ПредставлениеЗаписи + " (создание)";
	Иначе
		ЭтаФорма.Заголовок = Метаданные.Справочники.ДепозитарныеСчета.ПредставлениеОбъекта + " (создание)";
	КонецЕсли;
	
	// получим из переданных параметров счет д/у
	Если ЭтаФорма.Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ПараметрыЗаполнения = ЭтаФорма.Параметры.ЗначенияЗаполнения;
	Иначе
		ПараметрыЗаполнения = Новый Структура;
	КонецЕсли;
	
	// чтобы девочки не ошибкались, независисмо от источника вызова (счет депо или исполнитель),
	// исполнителя требуем зарегистрировать всегда,
	// кроме стратегий индивидуального инвестирования и депозитарного счета контрагента по сделке
	Если ПараметрыЗаполнения.Свойство("ВладелецСчета") 
	Тогда
		ЭтаФорма.ВладелецСчета = ПараметрыЗаполнения.ВладелецСчета;
		ЭтаФорма.ДепозитарныйСчетКонтрагента = Истина;
		ЭтаФорма.ЗарегистрироватьИсполнителя = Ложь;
		
		ЭтаФорма.ТипДепозитарногоСчета = Перечисления.ТипыДепозитарныхСчетов.Депозитарный;
		ЭтаФорма.ВидСчета = Перечисления.ВидыДепозитарныхСчетов.Основной;
		
	ИначеЕсли ЭтаФорма.Параметры.Свойство("ПараметрыВыбора")
		И ЭтаФорма.Параметры.ПараметрыВыбора.Свойство("ИсточникВызова")
		И ТипЗнч(ЭтаФорма.Параметры.ПараметрыВыбора.ИсточникВызова) = Тип("СправочникСсылка.СтратегииИндивидуальногоИнвестирования")
	Тогда
		ЭтаФорма.ЗарегистрироватьИсполнителя = Ложь;	
		Элементы.ЗарегистрироватьИсполнителя.Доступность = Ложь;
		Элементы.СчетДоверительногоУправления.Доступность = Ложь;
		ЭтаФорма.ВладелецСчета = ЭтаФорма.Организация.ЮрФизЛицо;
		Элементы.ВладелецСчета.Видимость = Ложь;
		
	Иначе
		ЭтаФорма.ЗарегистрироватьИсполнителя = Истина;	
		ЭтаФорма.ВладелецСчета = ЭтаФорма.Организация.ЮрФизЛицо;
		
	КонецЕсли;
	
	
	Если ПараметрыЗаполнения.Свойство("СчетДоверительногоУправления") Тогда
		ЭтаФорма.СчетДоверительногоУправления = ПараметрыЗаполнения.СчетДоверительногоУправления;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		
		Элементы.СчетДоверительногоУправления.ТолькоПросмотр = Истина;
		Элементы.ВладелецСчета.Видимость = Ложь;
		
		ЗаполнитьФормуПоРанееСозданнымИсполнителямНаСервере(Элементы.СчетДоверительногоУправления.Имя);
				
	ИначеЕсли ПараметрыЗаполнения.Свойство("ТипСчета") И ПараметрыЗаполнения.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета
		И ПараметрыЗаполнения.Свойство("Родитель") И ЗначениеЗаполнено(ПараметрыЗаполнения.Родитель)
	Тогда // отработаем создание раздела счета депо
	    Элементы.ГруппаДепозитарныйДоговор.ТолькоПросмотр = Истина;
		Элементы.ГруппаДепозитарныйСчет.ТолькоПросмотр    = Истина;
	
		ЭтаФорма.ВыбратьДепозитарныйДоговор      = 2;
		ЭтаФорма.ВыбратьДепозитарныйСчет         = 2;
		ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 1;
		
		ЭтаФорма.ДепозитарныйСчет = ПараметрыЗаполнения.Родитель;
		
		ЗаполнитьРеквизитыФормыПриИзмененииДепозитарногоСчета(ЭтаФорма, Истина);
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Депозитарий");
	
	Если ЭтаФорма.ЗарегистрироватьИсполнителя Тогда
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
	КонецЕсли;
	
	Если ЭтаФорма.ВыбратьДепозитарныйДоговор = 2 Тогда
		Если ЭтаФорма.ТипДепозитарногоСчета <> ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Лицевой") Тогда
			ПроверяемыеРеквизиты.Добавить("ДепозитарныйДоговор");
		КонецЕсли;
	ИначеЕсли ЭтаФорма.ВыбратьДепозитарныйДоговор = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("НомерДоговора");
		ПроверяемыеРеквизиты.Добавить("ДатаЗаключения");
		ПроверяемыеРеквизиты.Добавить("ВидДоговора");
	КонецЕсли;
	
	Если ЭтаФорма.ВыбратьДепозитарныйСчет = 2 Тогда
		ПроверяемыеРеквизиты.Добавить("ДепозитарныйСчет");
	ИначеЕсли ЭтаФорма.ВыбратьДепозитарныйСчет = 1 
	   И НЕ ЭтаФорма.ТипДепозитарногоСчета = ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение") Тогда
		ПроверяемыеРеквизиты.Добавить("ВидСчета");
		ПроверяемыеРеквизиты.Добавить("НомерСчета");
		ПроверяемыеРеквизиты.Добавить("ДатаОткрытияСчета");
	ИначеЕсли ЭтаФорма.ДепозитарныйСчетКонтрагента Тогда
		ПроверяемыеРеквизиты.Добавить("ТипДепозитарногоСчета");
		ПроверяемыеРеквизиты.Добавить("ВладелецСчета");
		ПроверяемыеРеквизиты.Добавить("НомерСчета");
	КонецЕсли;	
	
	Если ЭтаФорма.ТипДепозитарногоСчета = ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Лицевой") Тогда
		ПроверяемыеРеквизиты.Добавить("Эмитент");
	КонецЕсли;	
	
	Если ЭтаФорма.Попекаемый Тогда
		ПроверяемыеРеквизиты.Добавить("Попечитель");
	КонецЕсли;
	
	Если      ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 2 Тогда
		ПроверяемыеРеквизиты.Добавить("РазделДепозитарногоСчета");
	ИначеЕсли ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("НомерРаздела");		
		ПроверяемыеРеквизиты.Добавить("ДатаОткрытияРазделаСчета");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСписокВыбораТипаДепозитарногоСчета();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЗарегистрироватьИсполнителяПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ЗарегистрироватьИсполнителя Тогда
		ЭтаФорма.СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДепозитарныйДоговорПриИзменении(Элемент)
	
	Если ЭтаФорма.ВыбратьДепозитарныйДоговор = 1 Тогда // отсутствует или создать
		ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "ДепозитарныйДоговор, Депозитарий, ВидДоговора, НомерДоговора, ДатаЗаключения");
	ИначеЕсли  ЭтаФорма.ВыбратьДепозитарныйДоговор = 3 Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "ДепозитарныйДоговор, ВидДоговора, НомерДоговора, ДатаЗаключения");
	КонецЕсли;	

	ЭтаФорма.ВыбратьДепозитарныйСчет = 1;
	
	ВыбратьДепозитарныйСчетПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитарныйДоговорПриИзменении(Элемент)
	
	ЭтаФорма.ВыбратьДепозитарныйСчет = 1;
		
	ВыбратьДепозитарныйСчетПриИзменении(Неопределено);
	
	ЗаполнитьРеквизитыФормыПриИзмененииДепозитарногоДоговора(ЭтаФорма);		
		
	ДатаРасторженияПриИзменении(Неопределено);
		
	Если ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) И ЗначениеЗаполнено(ЭтаФорма.ДепозитарныйДоговор) Тогда
		ЗаполнитьФормуПоРанееСозданнымИсполнителямНаСервере(Элемент.Имя);
	КонецЕсли;
	
	УстановитьСписокВыбораТипаДепозитарногоСчета();	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	УстановитьСписокВыбораТипаДепозитарногоСчета();	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРасторженияПриИзменении(Элемент)
	
	ЭтаФорма.ДатаЗакрытия = ЭтаФорма.ДатаРасторжения;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДепозитарныйСчетПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "ДепозитарныйСчет, ТипДепозитарногоСчета, ВидСчета, НомерСчета, Попекаемый, Попечитель, ДоговорПопечения");
	
	ЭтаФорма.ДатаЗакрытия = ЭтаФорма.ДатаРасторжения;
		
	ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 0;
	
	ВыбратьРазделДепозитарногоСчетаПриИзменении(Неопределено);
	
	Если ВыбратьДепозитарныйСчет = 1 Тогда
		УстановитьСписокВыбораТипаДепозитарногоСчета();		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитарныйСчетПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыФормыПриИзмененииДепозитарногоСчета(ЭтаФорма);	
	ВидСчетаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделДепозитарногоСчетаПриИзменении(Элемент)
		
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.ВидСчета = ПредопределенноеЗначение("Перечисление.ВидыДепозитарныхСчетов.Торговый") 
		или ЭтаФорма.ВидСчета = ПредопределенноеЗначение("Перечисление.ВидыДепозитарныхСчетов.DVP") Тогда
		ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 1;
	Иначе
		ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 0;
	КонецЕсли;
	
	ВыбратьРазделДепозитарногоСчетаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПопекаемыйПриИзменении(Элемент)
	
	Если Не ЭтаФорма.Попекаемый Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "Попечитель, ДоговорПопечения");
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРазделДепозитарногоСчетаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "РазделДепозитарногоСчета, НомерРаздела, Брокер");
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДепозитарийПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокВыбораТипаДепозитарногоСчета()
	
	МассивТиповДепозитарныхСчетов = Новый Массив;
	
	Если ЭтаФорма.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоров.ОтветственногоХранения") Тогда
		МассивТиповДепозитарныхСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение"));
	ИначеЕсли ЭтаФорма.ВыбратьДепозитарныйДоговор = 3 Тогда
		МассивТиповДепозитарныхСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Лицевой"));
	Иначе
		МассивТиповДепозитарныхСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Депозитарный"));
		МассивТиповДепозитарныхСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Лицевой"));
		МассивТиповДепозитарныхСчетов.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение"));
	КонецЕсли;
	
	Если МассивТиповДепозитарныхСчетов.Найти(ЭтаФорма.ТипДепозитарногоСчета) = Неопределено Тогда
		Элементы.ТипДепозитарногоСчета.СписокВыбора.ЗагрузитьЗначения(МассивТиповДепозитарныхСчетов);
		ЭтаФорма.ТипДепозитарногоСчета = МассивТиповДепозитарныхСчетов[0];
		ТипДепозитарногоСчетаПриИзменении(Неопределено);
	Иначе 
		Элементы.ТипДепозитарногоСчета.СписокВыбора.ЗагрузитьЗначения(МассивТиповДепозитарныхСчетов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДепозитарногоСчетаПриИзменении(Элемент)
	
	Если ЭтаФорма.ТипДепозитарногоСчета = ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.ОтветственноеХранение") Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "ВидСчета, НомерСчета");
		
		ЭтаФорма.Попекаемый = Ложь;
				
		ПопекаемыйПриИзменении(Неопределено);
		
		ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 0;
		
		ВыбратьРазделДепозитарногоСчетаПриИзменении(Неопределено);
		
	ИначеЕсли ЭтаФорма.ТипДепозитарногоСчета = ПредопределенноеЗначение("Перечисление.ТипыДепозитарныхСчетов.Лицевой") Тогда
		Если ВидСчета <> ПредопределенноеЗначение("Перечисление.ВидыДепозитарныхСчетов.Основной") Тогда
			ВидСчета = ПредопределенноеЗначение("Перечисление.ВидыДепозитарныхСчетов.Основной");
			ВыбратьРазделДепозитарногоСчета = 0;
			ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтаФорма, "РазделДепозитарногоСчета, НомерРаздела, Брокер");
		КонецЕсли;

	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТипДепозитарногоСчетаКонтрагентаПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецСчетаПриИзменении(Элемент)
	
	ЭтаФорма.ДепозитарныйСчетКонтрагента = НЕ (ЭтаФорма.ВладелецСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Организация, "ЮрФизЛицо"));
	
	Если ЭтаФорма.ДепозитарныйСчетКонтрагента Тогда
		ЭтаФорма.ЗарегистрироватьИсполнителя = Ложь;
	Иначе
		ЭтаФорма.ЗарегистрироватьИсполнителя = Истина;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СоздатьДепозитарныйСчетНаСервере() Тогда
		ПоказатьПредупреждение(,"Не удалось записать исполнителя по ценным бумагам");
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.ВыбратьДепозитарныйДоговор = 1 Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.Договоры"));
	КонецЕсли;
	
	Если ЭтаФорма.ВыбратьДепозитарныйСчет = 1 
	 ИЛИ ЭтаФорма.ВыбратьРазделДепозитарногоСчета = 1
	 ИЛИ ЭтаФорма.ДепозитарныйСчетКонтрагента Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.ДепозитарныеСчета"));
	КонецЕсли;
	
	Если ЭтаФорма.ЗарегистрироватьИсполнителя Тогда
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ИсполнителиПоЦеннымБумагам"));
		
		Оповестить("ИсполнителиПоЦеннымБумагам.ФормаСписка.УстановитьТекущуюЗапись",
			Новый Структура("Организация, СчетДоверительногоУправления, ДепозитарныйСчет", ЭтаФорма.Организация, ЭтаФорма.СчетДоверительногоУправления, ЭтаФорма.ДепозитарныйСчет));
	КонецЕсли;
	
	Если ЭтаФорма.Модифицированность Тогда
		ЭтаФорма.Модифицированность = Ложь;
	КонецЕсли;
	
	ЭтаФорма.Закрыть(ЭтаФорма.ДепозитарныйСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированность);
	
КонецПроцедуры
